"use client"

import { useEffect } from "react";
import Reveal from "../components/animations/Reveal";
import Accordion from "../components/Accordion";

export default function Page() {
    useEffect(() => {
        window.scrollTo({ top: 0, behavior: 'smooth' });
    });

    const accordionIds = [
        {
            title: "มาตรฐานของสินค้าของที่ร้านเป็นอย่างไรบ้าง",
            description: "สินค้าของที่ร้านเป็นอะไหล่ทดแทนเทียบ OEM ผลิตจากโรงงานที่คัดสรรมาอย่างดี เพื่อให้ได้คุณภาพที่เทียบเท่ากับของแท้ นอกจากนี้ เรายังมีตัวแทนจำหน่ายมากกว่า 100 ร้านและอู่ทั่วประเทศ ลูกค้าสามารถไว้วางใจและสั่งซื้อสินค้าจากเราได้อย่างมั่นใจ"
        },
        {
            title: "ราคาของสินค้าของที่ร้านเป็นอย่างไรบ้าง และต่างจากร้านอื่นอย่างไร",
            description: "สินค้าของเรามีราคาที่คุ้มค่าพร้อมคุณภาพเกรดสูง งานสีและการประกอบมีความเรียบร้อยสมบูรณ์แบบ สามารถนำไปใช้แทนของเดิมได้แน่นอน ทางร้านขอแนะนำให้ระวังสินค้าราคาถูกจากผู้ขายรายอื่นในตลาด เพราะอาจไม่ได้รับการคัดเกรดและมีคุณภาพไม่ได้มาตรฐาน ลูกค้าหลายรายเสียเงินซ้ำซ้อนจากการซื้อสินค้าราคาถูกแล้วต้องมาซื้อสินค้าจากทางร้านเราในภายหลัง"
        },
        {
            title: "การจัดส่งมีประเภทไหนบ้าง ส่งด่วนได้หรือไม่",
            description: "สำหรับลูกค้าที่อยู่ในกรุงเทพฯ และปริมณฑล ทางร้านมีบริการส่งสินค้าแบบด่วนผ่าน Grab หรือ Lalamove โดยลูกค้าจะได้รับสินค้าภายในไม่เกิน 2-3 ชั่วโมง ซึ่งสะดวกและรวดเร็ว หรือลูกค้าที่อยู่จังหวัดอื่นๆ ทางร้านมีบริการส่ง EMS หรือบริการขนส่งต่างๆภายในวันที่สั่งซึ่งจะได้รับภายใน 1-3 วัน หรือสามารถติดต่อทางร้านเพื่อเข้ามารับที่หน้าร้านเองได้"
        },
        {
            title: "การรับประกันสินค้าของที่ร้านเป็นอย่างไรบ้าง",
            description: "สินค้าประเภทภายในและภายนอก หากได้รับสินค้าไม่ตรงกับที่ต้องการหรือมีตำหนิ สามารถเปลี่ยนได้ทันที สำหรับสินค้าอะไหล่ช่วงล่างมีการรับประกันนาน 3 เดือน หากสินค้ามีปัญหาจากการใช้งานปกติ ลูกค้าสามารถเปลี่ยนตัวใหม่ได้ทันที"
        },
        {
            title: "ทางร้านมีหน้าร้านหรือไม่",
            description: "ทางร้านเรามีหน้าร้านชัดเจน ลูกค้าสามารถมารับสินค้าหรือคืนสินค้าได้ในกรณีมีปัญหา สามารถติดต่อทางร้านได้ทุกช่องทางที่ลูกค้าสะดวก"
        },
    ];

    return (
        <>

            <div className="p-4 bg-gray-200">
                <Reveal>
                    <>
                        <h1 className="text-2xl md:text-3xl text-center font-notothai font-bold">คำถามที่พบบ่อย</h1>
                        <h1 className="text-2xl md:text-3xl text-center font-notothai font-bold">Frequently Asked Questions (FAQ)</h1>
                    </>
                </Reveal>
            </div>

            <div>
                <Reveal>
                    <div className="faq-items">
                        {accordionIds.map((item) => (
                            <Accordion
                                key={item.title}
                                question={item.title}
                                answer={item.description}
                            />
                        ))}
                    </div>
                </Reveal>
            </div>
        </>
    )
}